In [2]:
import pandas as pd
import numpy as np

In [4]:
s = pd.Series(['A','b','B','gear','AGER',np.nan])
s

0       A
1       b
2       B
3    gear
4    AGER
5     NaN
dtype: object

In [5]:
s.str.lower()

0       a
1       b
2       b
3    gear
4    ager
5     NaN
dtype: object

In [6]:
s.str.upper()

0       A
1       B
2       B
3    GEAR
4    AGER
5     NaN
dtype: object

In [10]:
index = pd.Index([' tang',' yu ','di'])
index

Index([' tang', ' yu ', 'di'], dtype='object')

In [11]:
index.str.strip()

Index(['tang', 'yu', 'di'], dtype='object')

In [12]:
index.str.lstrip()

Index(['tang', 'yu ', 'di'], dtype='object')

In [13]:
index.str.rstrip()

Index([' tang', ' yu', 'di'], dtype='object')

In [15]:
df = pd.DataFrame(np.random.randn(3,2), columns=['A a','B b'], index=range(3))
df

        A a       B b
0  0.291469 -1.555074
1 -0.838293 -0.803735
2 -0.922491  1.868352

In [16]:
df.columns = df.columns.str.replace(' ','_')
df

        A_a       B_b
0  0.291469 -1.555074
1 -0.838293 -0.803735
2 -0.922491  1.868352

In [17]:
s = pd.Series(['a_b_C','c_d_e','f_g_h'])
s

0    a_b_C
1    c_d_e
2    f_g_h
dtype: object

In [18]:
s.str.split('_')

0    [a, b, C]
1    [c, d, e]
2    [f, g, h]
dtype: object

In [19]:
s.str.split('_', expand=True)

   0  1  2
0  a  b  C
1  c  d  e
2  f  g  h

In [20]:
s.str.split('_', expand=True, n=1)

   0    1
0  a  b_C
1  c  d_e
2  f  g_h

In [21]:
s.str.split('_', expand=True, n=2)

   0  1  2
0  a  b  C
1  c  d  e
2  f  g  h

In [23]:
s.str.split('_', expand=True, n=4)

   0  1  2
0  a  b  C
1  c  d  e
2  f  g  h

In [24]:
s = pd.Series(['A','As','Assf','Agg'])
s

0       A
1      As
2    Assf
3     Agg
dtype: object

In [28]:
s.str.contains('Ag')

0    False
1    False
2    False
3     True
dtype: bool

In [29]:
s = pd.Series(['a','a|b','a|c'])
s

0      a
1    a|b
2    a|c
dtype: object

In [30]:
s.str.get_dummies(sep='|')

   a  b  c
0  1  0  0
1  1  1  0
2  1  0  1